MAIPLATE_FILE_ID_MAP = {
    '真極': '006101', 
    '真将': '0066op',
    '真神': '006102', 
    '真舞舞': '006103', 
    '超極': '006104', 
    '超将': '006105', 
    '超神': '006106', 
    '超舞舞': '006107', 
    '檄極': '006108', 
    '檄将': '006109', 
    '檄神': '006110', 
    '檄舞舞': '006111', 
    '橙極': '006112', 
    '橙将': '006113', 
    '橙神': '006114', 
    '橙舞舞': '006115', 
    '暁極': '006116', 
    '暁将': '006117', 
    '暁神': '006118', 
    '暁舞舞': '006119', 
    '桃極': '006120', 
    '桃将': '006121', 
    '桃神': '006122', 
    '桃舞舞': '006123', 
    '櫻極': '006124', 
    '櫻将': '006125', 
    '櫻神': '006126', 
    '櫻舞舞': '006127', 
    '紫極': '006128', 
    '紫将': '006129', 
    '紫神': '006130', 
    '紫舞舞': '006131', 
    '菫極': '006132', 
    '菫将': '006133', 
    '菫神': '006134', 
    '菫舞舞': '006135', 
    '白極': '006136', 
    '白将': '006137', 
    '白神': '006138', 
    '白舞舞': '006139', 
    '雪極': '006140', 
    '雪将': '006141', 
    '雪神': '006142', 
    '雪舞舞': '006143', 
    '輝極': '006144', 
    '輝将': '006145', 
    '輝神': '006146', 
    '輝舞舞': '006147', 
    '霸者': '006148', 
    '舞極': '006149', 
    '舞将': '006150', 
    '舞神': '006151', 
    '舞舞舞': '006152', 
    '熊極': '055101', 
    '熊将': '055102', 
    '熊神': '055103', 
    '熊舞舞': '055104', 
    '華極': '109101', 
    '華将': '109102', 
    '華神': '109103', 
    '華舞舞': '109104', 
    '爽極': '159101', 
    '爽将': '159102', 
    '爽神': '159103', 
    '爽舞舞': '159104', 
    '煌極': '209101', 
    '煌将': '209102', 
    '煌神': '209103', 
    '煌舞舞': '209104', 
    '宙極': '259101', 
    '宙将': '259102', 
    '宙神': '259103', 
    '宙舞舞': '259104', 
    '星極': '309101', 
    '星将': '309102', 
    '星神': '309103', 
    '星舞舞': '309104', 
    '祭極': '359101', 
    '祭将': '359102', 
    '祭神': '359103', 
    '祭舞舞': '359104', 
    '祝極': '409101', 
    '祝将': '409102', 
    '祝神': '409103', 
    '祝舞舞': '409104', 
    '双極': '459101', 
    '双将': '459102', 
    '双神': '459103',
    '双舞舞': '459104'
    }

VERSION_MAP = {
    "真": ["maimai PLUS", "maimai"],
    "超": ["maimai GreeN"],
    "檄": ["maimai GreeN PLUS"],
    "橙": ["maimai ORANGE"],
    "暁": ["maimai ORANGE PLUS"],
    "晓": ["maimai ORANGE PLUS"],
    "桃": ["maimai PiNK"],
    "櫻": ["maimai PiNK PLUS"],
    "樱": ["maimai PiNK PLUS"],
    "紫": ["maimai MURASAKi"],
    "菫": ["maimai MURASAKi PLUS"],
    "堇": ["maimai MURASAKi PLUS"],
    "懂": ["maimai MURASAKi PLUS"],
    "白": ["maimai MiLK"],
    "雪": ["MiLK PLUS"],
    "輝": ["maimai FiNALE"],
    "辉": ["maimai FiNALE"],
    "熊": ["舞萌DX"],
    "華": ["舞萌DX"],
    "华": ["舞萌DX"],
    "爽": ["舞萌DX 2021"],
    "煌": ["舞萌DX 2021"],
    "宙": ["舞萌DX 2022"],
    "星": ["舞萌DX 2022"],
    "祭": ["舞萌DX 2023"],
    "祝": ["舞萌DX 2023"],
    "双": ["舞萌DX 2024"],
    "舞": ["maimai PLUS", "maimai", "maimai GreeN", "maimai GreeN PLUS", "maimai ORANGE", "maimai ORANGE PLUS","maimai PiNK", "maimai PiNK PLUS", "maimai MURASAKi", "maimai MURASAKi PLUS", "maimai MiLK", "MiLK PLUS","maimai FiNALE"],
    "霸": ["maimai PLUS", "maimai", "maimai GreeN", "maimai GreeN PLUS", "maimai ORANGE", "maimai ORANGE PLUS","maimai PiNK", "maimai PiNK PLUS", "maimai MURASAKi", "maimai MURASAKi PLUS", "maimai MiLK", "MiLK PLUS","maimai FiNALE"]
}

TRADITIONAL2SIMPLIFIED = {
    "真": "真",
    "超": "超",
    "檄": "檄",
    "橙": "橙",
    "暁": "暁",
    "晓": "暁",
    "桃": "桃",
    "櫻": "櫻",
    "樱": "櫻",
    "紫": "紫",
    "菫": "菫",
    "堇": "菫",
    "懂": "菫",
    "白": "白",
    "雪": "雪",
    "輝": "輝",
    "辉": "輝",
    "熊": "熊",
    "華": "華",
    "华": "華",
    "爽": "爽",
    "煌": "煌",
    "宙": "宙",
    "星": "星",
    "祭": "祭",
    "祝": "祝",
    "双": "双",
    "舞": "舞",
    "霸": "霸",
    "极": "極"
}

VERSION_DF_MAP = {
    "真":["maimai PLUS","maimai"],
    "超":["maimai GreeN"],
    "檄":["maimai GreeN PLUS"],
    "橙":["maimai ORANGE"],
    "晓":["maimai ORANGE PLUS"],
    "桃":["maimai PiNK"],
    "樱":["maimai PiNK PLUS"],
    "紫":["maimai MURASAKi"],
    "堇":["maimai MURASAKi PLUS"],
    "白":["maimai MiLK"],
    "雪":["MiLK PLUS"],
    "辉":["maimai FiNALE"],
    "熊":["maimai でらっくす"],
    "华":["maimai でらっくす"],
    "爽":["maimai でらっくす Splash"],
    "煌":["maimai でらっくす Splash"],
    "宙":["maimai でらっくす UNiVERSE"],
    "星":["maimai でらっくす UNiVERSE"],
    "祭":["maimai でらっくす FESTiVAL"],
    "祝":["maimai でらっくす FESTiVAL"],
    "双":["maimai でらっくす BUDDiES"],
    "舞": ["maimai PLUS", "maimai", "maimai GreeN", "maimai GreeN PLUS", "maimai ORANGE", "maimai ORANGE PLUS","maimai PiNK", "maimai PiNK PLUS", "maimai MURASAKi", "maimai MURASAKi PLUS", "maimai MiLK", "MiLK PLUS","maimai FiNALE"],
    "霸": ["maimai PLUS", "maimai", "maimai GreeN", "maimai GreeN PLUS", "maimai ORANGE", "maimai ORANGE PLUS","maimai PiNK", "maimai PiNK PLUS", "maimai MURASAKi", "maimai MURASAKi PLUS", "maimai MiLK", "MiLK PLUS","maimai FiNALE"]
}

VERSION_LOGO_MAP = {
    "maimai":"100",
    "maimai PLUS":"110",
    "maimai GreeN":"120",
    "maimai GreeN PLUS":"130",
    "maimai ORANGE":"140",
    "maimai ORANGE PLUS":"150",
    "maimai PiNK":"160",
    "maimai PiNK PLUS":"170",
    "maimai MURASAKi":"180",
    "maimai MURASAKi PLUS":"185",
    "maimai MiLK":"190",
    "MiLK PLUS":"195",
    "maimai FiNALE":"199",
    "舞萌DX":"200",
    "舞萌DX 2021":"214",
    "舞萌DX 2022":"220",
    "舞萌DX 2023":"230",
    "舞萌DX 2024":"240"
}

VERSION_EZ_MAP = {
    "PLUS":"真",
    "maimai": "真",
    "GreeN":"超",
    "GreeN PLUS":"檄",
    "ORANGE":"橙",
    "ORANGE PLUS":"暁",
    "PiNK":"桃",
    "PiNK PLUS":"櫻",
    "MURASAKi":"紫",
    "MURASAKi PLUS":"菫",
    "MiLK":"白",
    "MiLK PLUS":"雪",
    "FiNALE":"輝",
    "FiNALE":"辉",
    "舞萌DX":"熊,華",
    "舞萌DX 2021":"爽、煌",
    "舞萌DX 2022":"宙、星",
    "舞萌DX 2023":"祭、祝",
    "舞萌DX 2024":"双"
}

ALL_VERSION_LIST = ["maimai PLUS","maimai","maimai GreeN","maimai GreeN PLUS","maimai ORANGE","maimai ORANGE PLUS","maimai PiNK","maimai PiNK PLUS","maimai MURASAKi","maimai MURASAKi PLUS","maimai MiLK","MiLK PLUS","maimai FiNALE","maimai でらっくす","maimai でらっくす FESTiVAL","maimai でらっくす UNiVERSE","maimai でらっくす Splash","maimai でらっくす BUDDiES"]

# 删除复活过滤曲
DELETED_MUSIC = [70,341,451,460,455,853,792,146,10146,189,419,687,731,11267,688,11213,712,11253,510,185,190,524]

# 当前游戏版本
NOW_VERSION = "舞萌DX 2024"

# 水鱼开发令牌
DEVELOPER_TOKEN = "FVXMqKTE51fWsR42gSdNrume9IkwGHYn"


USER_POKE_MESSAGE = [
    '我觉得吃披萨应该加95号汽油，并且应该加到试管底部1/3的位置，这样是为了拉格朗日点能够在爱因斯坦质能方程中找到属于自己的北回归线，如果不小心加错加了92号汽油，那就不好办了，首先要找到老爹让他念出戊戌变法，防止发动机和神经中枢对撞产生等离子火花和伽马射线，按照孔子的说法，我们还要把进化论里的化学方程式配平，这样才能让海尔兄弟放过舒克和贝塔', 
    '太阳的海平面上每天都会升起月亮，从而引起海绵宝宝生物钟的混乱导致派大星流产，所以必须要张果老带着赛亚人去日本才能阻止美国入侵伊拉克', 
    '我觉得太阳每天早上会从阿尔卑斯山脉的鲨鱼口中降落，哈姆雷特携带着超级赛亚人回到了花果山，而且如来的手指捏到了观音的八戒，所以唐僧带着三毛去珍珠港进行了广岛核爆演习', 
    '我认为好的意大利粥的做法应该是五常大米加一点长白山上的特仑苏搅拌成薄薄的厚片，因为这样可以生成美拉德反应，并且有利于经济的飞速发展，从而得出永乐大典失传的真相，爱因斯坦福说过，好的阿尔法突袭可以在一瞬间斩杀程咬金，防止他开大，再向B区扔个闪光蛋，这样才能在明朝小冰河时期拯救更多的黑猫警长。',
    '我认为在南北回归直线上不应该存在钢筋混凝土的哥德巴赫猜想微积分证明，因为海绵宝宝的生理期在夏季大洋环流会收到偏振效应的阻碍，从而偏离黑子熵增的观测，量子力学在其中发挥的作用就会受到阿尔法突袭的元婴期影响，所以大骨面提鲜运用的的收割理论在一定程度上不是那么具有波粒二象性',
    '我也不干沟通。我个人认为老谭酸菜牛肉面就应该配肾结石，因为双子座的第六感很容易召唤出塞牙超人。金字塔的拐点和东非大裂谷的粘度通过微积分可以证明猪腰子为什么嚼不烂。而且，商鞅当初变法就是为了满足欧洲贵族的生理需求，以便在百年后顺利让老佛爷生下二次元萝莉，这其实也不会影响西游记和葫芦娃在哔哩哔哩上的联动。',
    '我不敢苟同这样的说法，首先我认为老坛酸菜应该拥有准考证号，这样更能证明水是剧毒，但李白和白垩纪大灭绝的关系是属于乘法口诀表里的广义相对论，因此我推算出牛肉和原子弹的味道一样，喜欢吃肉和1+1=2这两种观点有很大的冲突，有人会觉得这观点偏激了，我们可以得知牛顿被苹果砸中后发现了钢筋混凝土喜欢鲨鱼后让莫比乌斯环分成两面，我们也可以得出西伯利亚与三体视频聊天通话中谈到的是米老鼠是应该按F，还是加鱼子酱的话题，总体来说，这都不影响潘子与虎哥在一起商讨鲨鱼应该吃混凝土还是穿内裤的问题',
    '我个人认为，这个意大利面就应该拌42号混凝土，因为这个螺丝钉的长度，它很容易会直接影响到挖掘机的扭矩你知道吧，你往里砸的时候，一瞬间它就会产生大量的高能蛋白，俗称ufo，会严重影响经济的发展，甚至对整个太平洋以及充电器都会造成一定的核污染，你知道吧啊？再者说，根据这个勾股定理，你可以很容易地推断出人工饲养的东条英机它是可以捕获野生的三角函数的，所以说这个这个这个这个，你不管秦始皇的切面是否具有放射性啊，特朗普的N次方是否含有沉淀物，都不影响这个沃尔玛跟维尔康在南极会合。',
    '其实我觉得吃盘子就得用面包端，因为全世界大约有3000种蚊子，每当蚊子扇动翅膀的时候，会产生温室效应，从而导致全世界引发大地震，地球偏离轨道，众所周知，世界万物都是有引力的，所以导致了成千上万人都经历了曼德拉效应，从而认为吃面包得用盘子端',
    '不敢苟同，我认为炒意大利面应该拌老干妈，因为螺丝钉向内扭的时候会产生二氧化碳，不利于经济发展，并且野生的乌鸦也会捕食三角函数。所以不论承重墙能不能打赢DK，宋江也能赢得世界杯',
    'xray有孩子这件事，我觉得和勾股定理是有关系的，热带雨林的蝴蝶煽动了翅膀导致了大气逆辐射的增加，这使得春天来临的速度加快，春天来的快就会让鸡交配更快，更快就意味着未来更多的鸡肉，这能使得肯德基持续采取疯狂星期X的计划，这个时候，由于厄尔尼诺的效应，产生了伽马射线，这样我们才能让xray生出更多的疯狂星期四，得出结论：V我50'
]

FORTUNE_LIST = [
    ['水群', '获得耶耶指点！飞升了', '没有人理你！'],
    ['出勤', '我也不知道你为什么宜查分,因为主人是这么写的~', '因为我会骂你啊哈哈哈哈哈'],
    ['收歌', 'Ap+1+1+1+1了呢~', '我又性了😅('],
    ['肯德基', '妈你戳，有什么好戳的', '你会被我骂~'],
    ['睡觉', '多睡觉身体好~', '一天就这样过去了，都不看Xray一眼('],
    ['练底力', '说不定底力今天就蹭蹭蹭的涨喽~', '越打越菜.......'],
    ['打旧框', '手感异常的好哇！！！', '机厅没网😅('],
    ['学习', '活到老学到老(', '怎么可能有这种事，w论如何都要学习的好吧~'],
    ['干饭', '吃饱了好推分捏~', '吃饱了就想摆烂了惹......'],
    ['抓绝赞', '一抓一个准！', '一落二爆三Miss~'],
    ['下埋', '路人小妹妹觉得你好菜的...', '润！！！！！！']
]



# QQ号权限
# 机修(机修哪去了、)
BOT_STAFF = [381268035]
# BOT管理员(重启BOT、退群、推送OSS、拉群自动同意、更新完成表)
BOT_DATA_ADMINISTRATOR = [381268035]
# BOT数据管理工作人员(开放黑白名单、直接添加别名)
BOT_DATA_STAFF = [381268035]

# 初号机ID(别名申请通知)
INITIAL_MACHINE = 3651135753



# 群号权限

# 自动同意进群申请(审核别名)
AUTO_ACCEPT_GROUP_REQUEST = [1019756397]
# 保存图片群权限(添加龙图、抽象画)
SAVE_IMAGE = [1019756397]

INITIAL_GROUP = 1019756397

# OSS推送配置项
ACCESSKEY_ID = ''
ACCESSKEY_SECRET = ''
END_POINT = ''
BUCKET_NAME = ''

# Mongo服务器配置
MONGO_USERNAME = ''
MONGO_PASSWORD = ''
MONGO_HOST = '127.0.0.1'
MONGO_PORT = 21017
MONGO_DATABASE = 'admin'

# 百度翻译Api
APP_ID = '' # 在百度翻译开放平台申请的App ID
SECRET_KEY = '' # 在百度翻译开放平台申请的Secret Key

# 高德APIKEY
API_KEY = ""